/*
Пузырьковая сортировка
[3, 1, 5, 0, 7, 9, 8]   изначальный массив

[3, 1, 5, 0, 7, 9, 8]   сравнивали 3 > 1, если да то меняем местами 3 и 1
[1, 3, 5, 0, 7, 9, 8]
[1, 3, 5, 9, 7, 9, 8]   сравниваем 1 > 3, 3 > 5, 5 > 0, если да меняем местамим 5 и 0 
[1, 3, 0, 5, 7, 9, 8]
[1, 3, 0, 5, 7, 9, 8]   сравниваем 1 > 3, 3 > 0, если да меняем местами 3 и 0
[1, 0, 3, 5, 7, 9, 8]
[1, 0, 3, 5, 7, 9, 8]   сравниваем 1 > 0, если да меняем местами 1 и 0
[0, 1, 3, 5, 7, 9, 8]
[0, 1, 3, 5, 7, 9, 8]   сравниваем 0 > 1, 1 > 3, 3 > 5, 5 > 7, 7 > 9, 9 > 8, если да меняем местами 9 и 8
[0, 1, 3, 5, 7, 8, 9]
[0, 1, 3, 5, 7, 8, 9]   проходими цикл заново, получаем отсортированный массив
*/
/*
Console.WriteLine("Введите кол-во элементов массива: ");
int n = Convert.ToInt32(Console.ReadLine());
int[] array = new int[n];
for(int i = 0; i < n; i++)
{
    Console.Write("Введите значение массива: ");
    array[i] = Convert.ToInt32(Console.ReadLine());
}
Console.WriteLine("Начальный массив: [" + string.Join(",", array) + "]");
Console.WriteLine();
for(int i = 0; i < n; i++)
{
    for(int j = 0; j < n -1; j++)
    {
        if(array[j] > array[j + 1])
        {
            int temp = array[j];
            array[j] = array[j + 1];
            array[j + 1] = temp;
        }
    }
    Console.WriteLine(i + "[" + string.Join(",", array) + "]");
}
*/